# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного максимума)

# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7] 6,13
# Вывод: [1, 9, 13, 14, 19]
from random import randint
n = 20
a = 6
b = 13
list_1 = [randint(-10, 10) for _ in range(n)]
list_2 =[]
print(f"Массив : {list_1}")
print(f"Минимальное число : {a}")
print(f"Максимальное число : {b}")
for i in range(len(list_1)):
    if a <= list_1[i] <= b:
        print(i, end = " ")

